apache/nuttx/arch/arm/src/kinetis/kinetis_flexcan.c
#ifdef CONFIG_KINETIS_FLEXCAN2
    case 2:
      priv         = &g_flexcan2;
      memset(priv, 0, sizeof(struct kinetis_driver_s));
      priv->base   = KINETIS_CAN2_BASE;
      priv->config = &kinetis_flexcan2_config;

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN2_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN2_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_SAMPLEP;
#  endif
      break;
#endif

    default:
      return -ENODEV;
    }

  if (!kinetis_bitratetotimeseg(&priv->arbi_timing, 1, 0))
    {
      nerr("ERROR: Invalid CAN timings please try another sample point "
           "or refer to the reference manual\n");
      return -1;
    }

#ifdef CONFIG_NET_CAN_CANFD
  if (!kinetis_bitratetotimeseg(&priv->data_timing, 1, 1))
    {
      nerr("ERROR: Invalid CAN data phase timings please try another "
           "sample point or refer to the reference manual\n");
      return -1;
    }
#endif

  kinetis_pinconfig(priv->config->tx_pin);
  kinetis_pinconfig(priv->config->rx_pin);
  if (priv->config->enable_pin > 0)
    {
      kinetis_pinconfig(priv->config->enable_pin);
      kinetis_gpiowrite(priv->config->enable_pin, priv->config->enable_high);
    }

  /* Attach the flexcan interrupt handler */

  if (irq_attach(priv->config->bus_irq, kinetis_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN bus IRQ\n");
      return -EAGAIN;
    }

  if (irq_attach(priv->config->error_irq, kinetis_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN error IRQ\n");
      return -EAGAIN;
    }

  if (priv->config->lprx_irq > 0)
    {
      if (irq_attach(priv->config->lprx_irq,
                     kinetis_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN LPRX IRQ\n");
          return -EAGAIN;
        }
    }

  if (irq_attach(priv->config->mb_irq, kinetis_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN OR'ed Message buffer (0-15) IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  priv->dev.d_ifup    = kinetis_ifup;      /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = kinetis_ifdown;    /* I/F down callback */
  priv->dev.d_txavail = kinetis_txavail;   /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = kinetis_ioctl;     /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = priv;              /* Used to recover private state from dev */
  priv->rx            = (struct mb_s *)(priv->base + KINETIS_CAN_MB_OFFSET);
  priv->tx            = (struct mb_s *)(priv->base + KINETIS_CAN_MB_OFFSET +
                          (sizeof(struct mb_s) * RXMBCOUNT));

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling kinetis_ifdown().
   */

  ninfo("callbacks done\n");

  kinetis_initialize(priv);

  kinetis_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, Ethernet controllers should
 *   be initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_KINETIS_FLEXCAN0
  kinetis_caninitialize(0);
#endif

#ifdef CONFIG_KINETIS_FLEXCAN1
  kinetis_caninitialize(1);
#endif

#ifdef CONFIG_KINETIS_FLEXCAN2
  kinetis_caninitialize(2);
#endif
}
#endif

#endif /* CONFIG_KINETIS_FLEXCAN */
